RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_touch.c
        case TOUCH_CHANNEL_11:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_RAW_DATA_11);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_RAW_DATA_CH11);
            break;
    }

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  get touch moudle LTA data
 *
 * @param  touchId: touch moudle ID
 * @param  tCh: touch moudle channel
 *
 * @return LTA data
 *
*******************************************************************************/
uint32_t TOUCH_GetLtaData(TOUCH_ID_Type touchId, TOUCH_CHANNEL_Type tCh)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));
    CHECK_PARAM(IS_TOUCH_CHANNEL_TYPE(tCh));

    switch (tCh) {
        case TOUCH_CHANNEL_0:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_0);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH0);
            break;

        case TOUCH_CHANNEL_1:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_1);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH1);
            break;

        case TOUCH_CHANNEL_2:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_2);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH2);
            break;

        case TOUCH_CHANNEL_3:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_3);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH3);
            break;

        case TOUCH_CHANNEL_4:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_4);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH4);
            break;

        case TOUCH_CHANNEL_5:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_5);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH5);
            break;

        case TOUCH_CHANNEL_6:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_6);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH6);
            break;

        case TOUCH_CHANNEL_7:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_7);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH7);
            break;

        case TOUCH_CHANNEL_8:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_8);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH8);
            break;

        case TOUCH_CHANNEL_9:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_9);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH9);
            break;

        case TOUCH_CHANNEL_10:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_10);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH10);
            break;

        case TOUCH_CHANNEL_11:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_LTA_DATA_11);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_LTA_DATA_CH11);
            break;
    }

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  get touch moudle FLT data
 *
 * @param  touchId: touch moudle ID
 * @param  tCh: touch moudle channel
 *
 * @return FLT data
 *
*******************************************************************************/
uint32_t TOUCH_GetFltData(TOUCH_ID_Type touchId, TOUCH_CHANNEL_Type tCh)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));
    CHECK_PARAM(IS_TOUCH_CHANNEL_TYPE(tCh));

    switch (tCh) {
        case TOUCH_CHANNEL_0:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_0);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH0);
            break;

        case TOUCH_CHANNEL_1:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_1);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH1);
            break;

        case TOUCH_CHANNEL_2:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_2);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH2);
            break;

        case TOUCH_CHANNEL_3:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_3);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH3);
            break;

        case TOUCH_CHANNEL_4:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_4);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH4);
            break;

        case TOUCH_CHANNEL_5:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_5);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH5);
            break;

        case TOUCH_CHANNEL_6:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_6);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH6);
            break;

        case TOUCH_CHANNEL_7:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_7);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH7);
            break;

        case TOUCH_CHANNEL_8:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_8);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH8);
            break;

        case TOUCH_CHANNEL_9:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_9);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH9);
            break;

        case TOUCH_CHANNEL_10:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_10);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH10);
            break;

        case TOUCH_CHANNEL_11:
            tmpVal = BL_RD_REG(PDS_BASE, PDS_CHANNEL_FLT_DATA_11);
            tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_FLT_DATA_CH11);
            break;
    }

    return tmpVal;
}

/****************************************************************************/ /**
 * @brief  get touch end flag
 *
 * @param  touchId: touch moudle ID
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type TOUCH_GetEndStatus(TOUCH_ID_Type touchId)
{
    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));

    return BL_GET_REG_BITS_VAL(BL_RD_REG(PDS_BASE, PDS_TOUCH_INT_STATUS), PDS_TOUCH_END_FLAG) ? SET : RESET;
}

/****************************************************************************/ /**
 * @brief  touch interrupt enable
 *
 * @param  touchId: touch moudle ID
 * @param  intType: touch moudle interrupt type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type TOUCH_IntEnable(TOUCH_ID_Type touchId, TOUCH_INT_Type intType)
{
    uint32_t tmpVal = 0;

