RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_touch.c
    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));
    CHECK_PARAM(IS_TOUCH_INT_TYPE(intType));

    tmpVal = BL_RD_REG(PDS_BASE, PDS_TOUCH_INT_SETTING);
    tmpVal = BL_SET_REG_BIT(tmpVal, PDS_TOUCH_INT_EN);
    tmpVal = BL_WR_REG(PDS_BASE, PDS_TOUCH_INT_SETTING, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  touch interrupt disable
 *
 * @param  touchId: touch moudle ID
 * @param  intType: touch moudle interrupt type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type TOUCH_IntDisable(TOUCH_ID_Type touchId, TOUCH_INT_Type intType)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));
    CHECK_PARAM(IS_TOUCH_INT_TYPE(intType));

    tmpVal = BL_RD_REG(PDS_BASE, PDS_TOUCH_INT_SETTING);
    tmpVal = BL_CLR_REG_BIT(tmpVal, PDS_TOUCH_INT_EN);
    tmpVal = BL_WR_REG(PDS_BASE, PDS_TOUCH_INT_SETTING, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  touch interrupt mask or not
 *
 * @param  touchId: touch moudle ID
 * @param  intType: touch moudle interrupt type
 * @param  tCh: touch moudle channel
 * @param  intMask: MASK or UNMASK
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type TOUCH_IntMask(TOUCH_ID_Type touchId, TOUCH_INT_Type intType, TOUCH_CHANNEL_Type tCh, BL_Mask_Type intMask)
{
    uint32_t tmpVal = 0;
    uint32_t tmpMask = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));
    CHECK_PARAM(IS_TOUCH_INT_TYPE(intType));
    CHECK_PARAM(IS_TOUCH_CHANNEL_TYPE(tCh));

    TOUCH_IntEnable(touchId, intType);

    tmpVal = BL_RD_REG(PDS_BASE, PDS_TOUCH_INT_SETTING);

    if (intMask == MASK) {
        tmpMask = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_INT_MASK);
        tmpMask |= (1 << tCh);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_INT_MASK, tmpMask);
    } else {
        tmpMask = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_INT_MASK);
        tmpMask &= (~(1 << tCh));
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_INT_MASK, tmpMask);
    }

    tmpVal = BL_WR_REG(PDS_BASE, PDS_TOUCH_INT_SETTING, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  get touch interrupt status
 *
 * @param  touchId: touch moudle ID
 * @param  intType: touch moudle interrupt type
 * @param  tCh: touch moudle channel
 *
 * @return SET or RESET
 *
*******************************************************************************/
BL_Sts_Type TOUCH_GetIntStatus(TOUCH_ID_Type touchId, TOUCH_INT_Type intType, TOUCH_CHANNEL_Type tCh)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));
    CHECK_PARAM(IS_TOUCH_INT_TYPE(intType));
    CHECK_PARAM(IS_TOUCH_CHANNEL_TYPE(tCh));

    tmpVal = BL_RD_REG(PDS_BASE, PDS_TOUCH_INT_STATUS);
    tmpVal = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_INT_STATUS);

    if (tmpVal & (1 << tCh)) {
        return SET;
    } else {
        return RESET;
    }
}

/****************************************************************************/ /**
 * @brief  clear touch interrupt status
 *
 * @param  touchId: touch moudle ID
 * @param  intType: touch moudle interrupt type
 * @param  tCh: touch moudle channel
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type TOUCH_ClrIntStatus(TOUCH_ID_Type touchId, TOUCH_INT_Type intType, TOUCH_CHANNEL_Type tCh)
{
    uint32_t tmpVal = 0;
    uint32_t tmpClr = 0;

    CHECK_PARAM(IS_TOUCH_ID_TYPE(touchId));
    CHECK_PARAM(IS_TOUCH_INT_TYPE(intType));
    CHECK_PARAM(IS_TOUCH_CHANNEL_TYPE(tCh));

    /* set */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_TOUCH_INT_SETTING);
    tmpClr = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_INT_CLR);
    tmpClr |= (1 << tCh);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_INT_CLR, tmpClr);
    tmpVal = BL_WR_REG(PDS_BASE, PDS_TOUCH_INT_SETTING, tmpVal);

    /* unset */
    tmpVal = BL_RD_REG(PDS_BASE, PDS_TOUCH_INT_SETTING);
    tmpClr = BL_GET_REG_BITS_VAL(tmpVal, PDS_TOUCH_INT_CLR);
    tmpClr &= (~(1 << tCh));
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PDS_TOUCH_INT_CLR, tmpClr);
    tmpVal = BL_WR_REG(PDS_BASE, PDS_TOUCH_INT_SETTING, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  install touch interrupt callback
 *
 * @param  touchId: touch moudle ID
 * @param  intType: touch moudle interrupt type
 * @param  tCh: touch moudle channel
 * @param  cbFun: callback function
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type TOUCH_INT_Callback_Install(TOUCH_ID_Type touchId, TOUCH_INT_Type intType, TOUCH_CHANNEL_Type tCh, intCallback_Type *cbFun)
{
    CHECK_PARAM(IS_TOUCH_INT_TYPE(intType));

    touchIntCbfArra[intType][tCh] = cbFun;

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  touch IRQ handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
void TOUCH_IRQHandler(void)
{
    TOUCH_CHANNEL_Type tmpCh;

    for (tmpCh = TOUCH_CHANNEL_0; tmpCh <= TOUCH_CHANNEL_11; tmpCh++) {
        if (SET == TOUCH_GetIntStatus(TOUCH_ID_0, TOUCH_INT_INTERRUPT, tmpCh)) {
            TOUCH_ClrIntStatus(TOUCH_ID_0, TOUCH_INT_INTERRUPT, tmpCh);

            if (touchIntCbfArra[TOUCH_INT_INTERRUPT][tmpCh] != NULL) {
                touchIntCbfArra[TOUCH_INT_INTERRUPT][tmpCh]();
            }
        }
    }
}

/*@} end of group TOUCH_Public_Functions */

/*@} end of group TOUCH */

/*@} end of group BL808_Peripheral_Driver */
